{"config": [{"config": {"padding": "valid", "kernel_constraint": null, "kernel_size": [5, 5], "trainable": true, "activity_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 28, 28, 3], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_30", "dilation_rate": [1, 1], "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_24", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "kernel_constraint": null, "kernel_size": [5, 5], "trainable": true, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_31", "dilation_rate": [1, 1], "filters": 64, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_25", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_9", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 1000, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_17", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 7, "activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_18", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Sequential"}